// Створити масив, довжину та елементи якого задає користувач.
//     Відсортувати масив за зростанням.
//     Видалити елементи з масиву з 2 по 4 (включно!).
// У міру змін виводити вміст масиву на сторінку.

let length = parseInt(prompt("Введіть довжину масиву:"));
let arr = [];

for (let i = 0; i < length; i++) {
    arr.push(parseInt(prompt(`Введіть елемент масиву з індексом ${i}:`)));
}

console.log("Масив до сортування:", arr);

arr.sort(function(a, b) {
    return a - b;
});

console.log("Масив після сортування:", arr);

arr.splice(2, 3);

console.log("Масив після видалення елементів:", arr);
